# Количество целочисленных точек в круге - 2

Определите количество целочисленных точек, находящихся внутри и на границе круга радиуса $r$
с центром в начале координат. 

## Формат входных данных

Первая строка содержит целое число $r$ ($1 \leqslant r \leqslant 10^6$).

## Формат результата

Выведите ответ на задачу.

## Примеры

------------------------------
входные данные  результат
--------------  --------------
2               13

6               113
------------------------------

## Примечание
                                                                        
Учтите, что для хранения ответа и возможно промежуточных вычислений, необходимо
использовать 64-х битный тип данных.
Подсказка для чтения/вывода в языке `C` (обязательно спросите преподавателя, почему так):

~~~  
  #include <inttypes.h>
  ...
  scanf("%" PRId64, &radius);
  ...
  printf("%" PRId64 "\n", points);
~~~

